backend/my_api/app/controllers/components_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "components" ("kind", "list_id", "part_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kind", "graphics"], ["list_id", 2], ["part_id", 17], ["created_at", "2021-07-28 19:52:34.399386"], ["updated_at", "2021-07-28 19:52:34.399386"]]
---
  def create
    @list = List.find_by_id(params[:list_id])
    # @part = Part.find_by_id(params[:part_id])
    @component = @list.components.build(component_params)
    if @component.save