backend/my_api/app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Anthony"], ["created_at", "2021-07-09 18:13:15.323129"], ["updated_at", "2021-07-09 18:13:15.323129"]]
---
  def create
    @list = List.new(list_params)
    # @list.add_components
    if @list.save